zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/twim.h
/* -------- TWIM_CMDR : (TWIM Offset: 0x0C) (R/W 32) Command Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t READ:1;           /*!< bit:      0  Transfer Direction                 */
    uint32_t SADR:10;          /*!< bit:  1..10  Slave Address                      */
    uint32_t TENBIT:1;         /*!< bit:     11  Ten Bit Addressing Mode            */
    uint32_t REPSAME:1;        /*!< bit:     12  Transfer is to same address as previous address */
    uint32_t START:1;          /*!< bit:     13  Send START condition               */
    uint32_t STOP:1;           /*!< bit:     14  Send STOP condition                */
    uint32_t VALID:1;          /*!< bit:     15  CMDR Valid                         */
    uint32_t NBYTES:8;         /*!< bit: 16..23  Number of data bytes in transfer   */
    uint32_t PECEN:1;          /*!< bit:     24  Packet Error Checking Enable       */
    uint32_t ACKLAST:1;        /*!< bit:     25  ACK Last Master RX Byte            */
    uint32_t HS:1;             /*!< bit:     26  HS-mode                            */
    uint32_t :1;               /*!< bit:     27  Reserved                           */
    uint32_t HSMCODE:3;        /*!< bit: 28..30  HS-mode Master Code                */
    uint32_t :1;               /*!< bit:     31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIM_CMDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIM_CMDR_OFFSET            0x0C         /**< \brief (TWIM_CMDR offset) Command Register */
#define TWIM_CMDR_RESETVALUE        _U_(0x00000000); /**< \brief (TWIM_CMDR reset_value) Command Register */

#define TWIM_CMDR_READ_Pos          0            /**< \brief (TWIM_CMDR) Transfer Direction */
#define TWIM_CMDR_READ              (_U_(0x1) << TWIM_CMDR_READ_Pos)
#define TWIM_CMDR_SADR_Pos          1            /**< \brief (TWIM_CMDR) Slave Address */
#define TWIM_CMDR_SADR_Msk          (_U_(0x3FF) << TWIM_CMDR_SADR_Pos)
#define TWIM_CMDR_SADR(value)       (TWIM_CMDR_SADR_Msk & ((value) << TWIM_CMDR_SADR_Pos))
#define TWIM_CMDR_TENBIT_Pos        11           /**< \brief (TWIM_CMDR) Ten Bit Addressing Mode */
#define TWIM_CMDR_TENBIT            (_U_(0x1) << TWIM_CMDR_TENBIT_Pos)
#define TWIM_CMDR_REPSAME_Pos       12           /**< \brief (TWIM_CMDR) Transfer is to same address as previous address */
#define TWIM_CMDR_REPSAME           (_U_(0x1) << TWIM_CMDR_REPSAME_Pos)
#define TWIM_CMDR_START_Pos         13           /**< \brief (TWIM_CMDR) Send START condition */
#define TWIM_CMDR_START             (_U_(0x1) << TWIM_CMDR_START_Pos)
#define TWIM_CMDR_STOP_Pos          14           /**< \brief (TWIM_CMDR) Send STOP condition */
#define TWIM_CMDR_STOP              (_U_(0x1) << TWIM_CMDR_STOP_Pos)
#define TWIM_CMDR_VALID_Pos         15           /**< \brief (TWIM_CMDR) CMDR Valid */
#define TWIM_CMDR_VALID             (_U_(0x1) << TWIM_CMDR_VALID_Pos)
#define TWIM_CMDR_NBYTES_Pos        16           /**< \brief (TWIM_CMDR) Number of data bytes in transfer */
#define TWIM_CMDR_NBYTES_Msk        (_U_(0xFF) << TWIM_CMDR_NBYTES_Pos)
#define TWIM_CMDR_NBYTES(value)     (TWIM_CMDR_NBYTES_Msk & ((value) << TWIM_CMDR_NBYTES_Pos))
#define TWIM_CMDR_PECEN_Pos         24           /**< \brief (TWIM_CMDR) Packet Error Checking Enable */
#define TWIM_CMDR_PECEN             (_U_(0x1) << TWIM_CMDR_PECEN_Pos)
#define TWIM_CMDR_ACKLAST_Pos       25           /**< \brief (TWIM_CMDR) ACK Last Master RX Byte */
#define TWIM_CMDR_ACKLAST           (_U_(0x1) << TWIM_CMDR_ACKLAST_Pos)
#define TWIM_CMDR_HS_Pos            26           /**< \brief (TWIM_CMDR) HS-mode */
#define TWIM_CMDR_HS                (_U_(0x1) << TWIM_CMDR_HS_Pos)
#define TWIM_CMDR_HSMCODE_Pos       28           /**< \brief (TWIM_CMDR) HS-mode Master Code */
#define TWIM_CMDR_HSMCODE_Msk       (_U_(0x7) << TWIM_CMDR_HSMCODE_Pos)
#define TWIM_CMDR_HSMCODE(value)    (TWIM_CMDR_HSMCODE_Msk & ((value) << TWIM_CMDR_HSMCODE_Pos))
#define TWIM_CMDR_MASK              _U_(0x77FFFFFF) /**< \brief (TWIM_CMDR) MASK Register */

/* -------- TWIM_NCMDR : (TWIM Offset: 0x10) (R/W 32) Next Command Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t READ:1;           /*!< bit:      0  Transfer Direction                 */
    uint32_t SADR:10;          /*!< bit:  1..10  Slave Address                      */
    uint32_t TENBIT:1;         /*!< bit:     11  Ten Bit Addressing Mode            */
    uint32_t REPSAME:1;        /*!< bit:     12  Transfer is to same address as previous address */
    uint32_t START:1;          /*!< bit:     13  Send START condition               */
    uint32_t STOP:1;           /*!< bit:     14  Send STOP condition                */
    uint32_t VALID:1;          /*!< bit:     15  CMDR Valid                         */
    uint32_t NBYTES:8;         /*!< bit: 16..23  Number of data bytes in transfer   */
    uint32_t PECEN:1;          /*!< bit:     24  Packet Error Checking Enable       */
    uint32_t ACKLAST:1;        /*!< bit:     25  ACK Last Master RX Byte            */
    uint32_t HS:1;             /*!< bit:     26  HS-mode                            */
    uint32_t :1;               /*!< bit:     27  Reserved                           */
    uint32_t HSMCODE:3;        /*!< bit: 28..30  HS-mode Master Code                */
    uint32_t :1;               /*!< bit:     31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIM_NCMDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIM_NCMDR_OFFSET           0x10         /**< \brief (TWIM_NCMDR offset) Next Command Register */
#define TWIM_NCMDR_RESETVALUE       _U_(0x00000000); /**< \brief (TWIM_NCMDR reset_value) Next Command Register */

#define TWIM_NCMDR_READ_Pos         0            /**< \brief (TWIM_NCMDR) Transfer Direction */
#define TWIM_NCMDR_READ             (_U_(0x1) << TWIM_NCMDR_READ_Pos)
#define TWIM_NCMDR_SADR_Pos         1            /**< \brief (TWIM_NCMDR) Slave Address */
#define TWIM_NCMDR_SADR_Msk         (_U_(0x3FF) << TWIM_NCMDR_SADR_Pos)
#define TWIM_NCMDR_SADR(value)      (TWIM_NCMDR_SADR_Msk & ((value) << TWIM_NCMDR_SADR_Pos))
#define TWIM_NCMDR_TENBIT_Pos       11           /**< \brief (TWIM_NCMDR) Ten Bit Addressing Mode */
#define TWIM_NCMDR_TENBIT           (_U_(0x1) << TWIM_NCMDR_TENBIT_Pos)
#define TWIM_NCMDR_REPSAME_Pos      12           /**< \brief (TWIM_NCMDR) Transfer is to same address as previous address */
#define TWIM_NCMDR_REPSAME          (_U_(0x1) << TWIM_NCMDR_REPSAME_Pos)
#define TWIM_NCMDR_START_Pos        13           /**< \brief (TWIM_NCMDR) Send START condition */
#define TWIM_NCMDR_START            (_U_(0x1) << TWIM_NCMDR_START_Pos)
#define TWIM_NCMDR_STOP_Pos         14           /**< \brief (TWIM_NCMDR) Send STOP condition */
#define TWIM_NCMDR_STOP             (_U_(0x1) << TWIM_NCMDR_STOP_Pos)
#define TWIM_NCMDR_VALID_Pos        15           /**< \brief (TWIM_NCMDR) CMDR Valid */
#define TWIM_NCMDR_VALID            (_U_(0x1) << TWIM_NCMDR_VALID_Pos)
#define TWIM_NCMDR_NBYTES_Pos       16           /**< \brief (TWIM_NCMDR) Number of data bytes in transfer */
#define TWIM_NCMDR_NBYTES_Msk       (_U_(0xFF) << TWIM_NCMDR_NBYTES_Pos)
#define TWIM_NCMDR_NBYTES(value)    (TWIM_NCMDR_NBYTES_Msk & ((value) << TWIM_NCMDR_NBYTES_Pos))
#define TWIM_NCMDR_PECEN_Pos        24           /**< \brief (TWIM_NCMDR) Packet Error Checking Enable */
#define TWIM_NCMDR_PECEN            (_U_(0x1) << TWIM_NCMDR_PECEN_Pos)
#define TWIM_NCMDR_ACKLAST_Pos      25           /**< \brief (TWIM_NCMDR) ACK Last Master RX Byte */
#define TWIM_NCMDR_ACKLAST          (_U_(0x1) << TWIM_NCMDR_ACKLAST_Pos)
#define TWIM_NCMDR_HS_Pos           26           /**< \brief (TWIM_NCMDR) HS-mode */
#define TWIM_NCMDR_HS               (_U_(0x1) << TWIM_NCMDR_HS_Pos)
#define TWIM_NCMDR_HSMCODE_Pos      28           /**< \brief (TWIM_NCMDR) HS-mode Master Code */
#define TWIM_NCMDR_HSMCODE_Msk      (_U_(0x7) << TWIM_NCMDR_HSMCODE_Pos)
#define TWIM_NCMDR_HSMCODE(value)   (TWIM_NCMDR_HSMCODE_Msk & ((value) << TWIM_NCMDR_HSMCODE_Pos))
#define TWIM_NCMDR_MASK             _U_(0x77FFFFFF) /**< \brief (TWIM_NCMDR) MASK Register */

/* -------- TWIM_RHR : (TWIM Offset: 0x14) (R/  32) Receive Holding Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXDATA:8;         /*!< bit:  0.. 7  Received Data                      */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIM_RHR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIM_RHR_OFFSET             0x14         /**< \brief (TWIM_RHR offset) Receive Holding Register */
#define TWIM_RHR_RESETVALUE         _U_(0x00000000); /**< \brief (TWIM_RHR reset_value) Receive Holding Register */

#define TWIM_RHR_RXDATA_Pos         0            /**< \brief (TWIM_RHR) Received Data */
#define TWIM_RHR_RXDATA_Msk         (_U_(0xFF) << TWIM_RHR_RXDATA_Pos)
#define TWIM_RHR_RXDATA(value)      (TWIM_RHR_RXDATA_Msk & ((value) << TWIM_RHR_RXDATA_Pos))
#define TWIM_RHR_MASK               _U_(0x000000FF) /**< \brief (TWIM_RHR) MASK Register */

/* -------- TWIM_THR : (TWIM Offset: 0x18) ( /W 32) Transmit Holding Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t TXDATA:8;         /*!< bit:  0.. 7  Data to Transmit                   */
    uint32_t :24;              /*!< bit:  8..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIM_THR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIM_THR_OFFSET             0x18         /**< \brief (TWIM_THR offset) Transmit Holding Register */
#define TWIM_THR_RESETVALUE         _U_(0x00000000); /**< \brief (TWIM_THR reset_value) Transmit Holding Register */

#define TWIM_THR_TXDATA_Pos         0            /**< \brief (TWIM_THR) Data to Transmit */
#define TWIM_THR_TXDATA_Msk         (_U_(0xFF) << TWIM_THR_TXDATA_Pos)
#define TWIM_THR_TXDATA(value)      (TWIM_THR_TXDATA_Msk & ((value) << TWIM_THR_TXDATA_Pos))
#define TWIM_THR_MASK               _U_(0x000000FF) /**< \brief (TWIM_THR) MASK Register */

/* -------- TWIM_SR : (TWIM Offset: 0x1C) (R/  32) Status Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXRDY:1;          /*!< bit:      0  RHR Data Ready                     */
    uint32_t TXRDY:1;          /*!< bit:      1  THR Data Ready                     */
    uint32_t CRDY:1;           /*!< bit:      2  Ready for More Commands            */
    uint32_t CCOMP:1;          /*!< bit:      3  Command Complete                   */
    uint32_t IDLE:1;           /*!< bit:      4  Master Interface is Idle           */
    uint32_t BUSFREE:1;        /*!< bit:      5  Two-wire Bus is Free               */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t ANAK:1;           /*!< bit:      8  NAK in Address Phase Received      */
    uint32_t DNAK:1;           /*!< bit:      9  NAK in Data Phase Received         */
    uint32_t ARBLST:1;         /*!< bit:     10  Arbitration Lost                   */
    uint32_t SMBALERT:1;       /*!< bit:     11  SMBus Alert                        */
    uint32_t TOUT:1;           /*!< bit:     12  Timeout                            */
    uint32_t PECERR:1;         /*!< bit:     13  PEC Error                          */
    uint32_t STOP:1;           /*!< bit:     14  Stop Request Accepted              */
    uint32_t :1;               /*!< bit:     15  Reserved                           */
    uint32_t MENB:1;           /*!< bit:     16  Master Interface Enable            */
    uint32_t HSMCACK:1;        /*!< bit:     17  ACK in HS-mode Master Code Phase Received */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIM_SR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIM_SR_OFFSET              0x1C         /**< \brief (TWIM_SR offset) Status Register */
#define TWIM_SR_RESETVALUE          _U_(0x00000002); /**< \brief (TWIM_SR reset_value) Status Register */

#define TWIM_SR_RXRDY_Pos           0            /**< \brief (TWIM_SR) RHR Data Ready */
#define TWIM_SR_RXRDY               (_U_(0x1) << TWIM_SR_RXRDY_Pos)
#define TWIM_SR_TXRDY_Pos           1            /**< \brief (TWIM_SR) THR Data Ready */
#define TWIM_SR_TXRDY               (_U_(0x1) << TWIM_SR_TXRDY_Pos)
#define TWIM_SR_CRDY_Pos            2            /**< \brief (TWIM_SR) Ready for More Commands */
#define TWIM_SR_CRDY                (_U_(0x1) << TWIM_SR_CRDY_Pos)
#define TWIM_SR_CCOMP_Pos           3            /**< \brief (TWIM_SR) Command Complete */
#define TWIM_SR_CCOMP               (_U_(0x1) << TWIM_SR_CCOMP_Pos)
#define TWIM_SR_IDLE_Pos            4            /**< \brief (TWIM_SR) Master Interface is Idle */
#define TWIM_SR_IDLE                (_U_(0x1) << TWIM_SR_IDLE_Pos)
#define TWIM_SR_BUSFREE_Pos         5            /**< \brief (TWIM_SR) Two-wire Bus is Free */
#define TWIM_SR_BUSFREE             (_U_(0x1) << TWIM_SR_BUSFREE_Pos)
#define TWIM_SR_ANAK_Pos            8            /**< \brief (TWIM_SR) NAK in Address Phase Received */
#define TWIM_SR_ANAK                (_U_(0x1) << TWIM_SR_ANAK_Pos)
#define TWIM_SR_DNAK_Pos            9            /**< \brief (TWIM_SR) NAK in Data Phase Received */
#define TWIM_SR_DNAK                (_U_(0x1) << TWIM_SR_DNAK_Pos)
#define TWIM_SR_ARBLST_Pos          10           /**< \brief (TWIM_SR) Arbitration Lost */
#define TWIM_SR_ARBLST              (_U_(0x1) << TWIM_SR_ARBLST_Pos)
#define TWIM_SR_SMBALERT_Pos        11           /**< \brief (TWIM_SR) SMBus Alert */
#define TWIM_SR_SMBALERT            (_U_(0x1) << TWIM_SR_SMBALERT_Pos)
#define TWIM_SR_TOUT_Pos            12           /**< \brief (TWIM_SR) Timeout */
#define TWIM_SR_TOUT                (_U_(0x1) << TWIM_SR_TOUT_Pos)
#define TWIM_SR_PECERR_Pos          13           /**< \brief (TWIM_SR) PEC Error */
#define TWIM_SR_PECERR              (_U_(0x1) << TWIM_SR_PECERR_Pos)
#define TWIM_SR_STOP_Pos            14           /**< \brief (TWIM_SR) Stop Request Accepted */
#define TWIM_SR_STOP                (_U_(0x1) << TWIM_SR_STOP_Pos)
#define TWIM_SR_MENB_Pos            16           /**< \brief (TWIM_SR) Master Interface Enable */
#define TWIM_SR_MENB                (_U_(0x1) << TWIM_SR_MENB_Pos)
#define TWIM_SR_HSMCACK_Pos         17           /**< \brief (TWIM_SR) ACK in HS-mode Master Code Phase Received */
#define TWIM_SR_HSMCACK             (_U_(0x1) << TWIM_SR_HSMCACK_Pos)
#define TWIM_SR_MASK                _U_(0x00037F3F) /**< \brief (TWIM_SR) MASK Register */

/* -------- TWIM_IER : (TWIM Offset: 0x20) ( /W 32) Interrupt Enable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXRDY:1;          /*!< bit:      0  RHR Data Ready                     */
    uint32_t TXRDY:1;          /*!< bit:      1  THR Data Ready                     */
    uint32_t CRDY:1;           /*!< bit:      2  Ready for More Commands            */
    uint32_t CCOMP:1;          /*!< bit:      3  Command Complete                   */
    uint32_t IDLE:1;           /*!< bit:      4  Master Interface is Idle           */
    uint32_t BUSFREE:1;        /*!< bit:      5  Two-wire Bus is Free               */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t ANAK:1;           /*!< bit:      8  NAK in Address Phase Received      */
    uint32_t DNAK:1;           /*!< bit:      9  NAK in Data Phase Received         */
    uint32_t ARBLST:1;         /*!< bit:     10  Arbitration Lost                   */
    uint32_t SMBALERT:1;       /*!< bit:     11  SMBus Alert                        */
    uint32_t TOUT:1;           /*!< bit:     12  Timeout                            */
    uint32_t PECERR:1;         /*!< bit:     13  PEC Error                          */
    uint32_t STOP:1;           /*!< bit:     14  Stop Request Accepted              */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t HSMCACK:1;        /*!< bit:     17  ACK in HS-mode Master Code Phase Received */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIM_IER_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIM_IER_OFFSET             0x20         /**< \brief (TWIM_IER offset) Interrupt Enable Register */
#define TWIM_IER_RESETVALUE         _U_(0x00000000); /**< \brief (TWIM_IER reset_value) Interrupt Enable Register */

#define TWIM_IER_RXRDY_Pos          0            /**< \brief (TWIM_IER) RHR Data Ready */
#define TWIM_IER_RXRDY              (_U_(0x1) << TWIM_IER_RXRDY_Pos)
#define TWIM_IER_TXRDY_Pos          1            /**< \brief (TWIM_IER) THR Data Ready */
#define TWIM_IER_TXRDY              (_U_(0x1) << TWIM_IER_TXRDY_Pos)
#define TWIM_IER_CRDY_Pos           2            /**< \brief (TWIM_IER) Ready for More Commands */
#define TWIM_IER_CRDY               (_U_(0x1) << TWIM_IER_CRDY_Pos)
#define TWIM_IER_CCOMP_Pos          3            /**< \brief (TWIM_IER) Command Complete */
#define TWIM_IER_CCOMP              (_U_(0x1) << TWIM_IER_CCOMP_Pos)
#define TWIM_IER_IDLE_Pos           4            /**< \brief (TWIM_IER) Master Interface is Idle */
#define TWIM_IER_IDLE               (_U_(0x1) << TWIM_IER_IDLE_Pos)
#define TWIM_IER_BUSFREE_Pos        5            /**< \brief (TWIM_IER) Two-wire Bus is Free */
#define TWIM_IER_BUSFREE            (_U_(0x1) << TWIM_IER_BUSFREE_Pos)
#define TWIM_IER_ANAK_Pos           8            /**< \brief (TWIM_IER) NAK in Address Phase Received */
#define TWIM_IER_ANAK               (_U_(0x1) << TWIM_IER_ANAK_Pos)
#define TWIM_IER_DNAK_Pos           9            /**< \brief (TWIM_IER) NAK in Data Phase Received */
#define TWIM_IER_DNAK               (_U_(0x1) << TWIM_IER_DNAK_Pos)
#define TWIM_IER_ARBLST_Pos         10           /**< \brief (TWIM_IER) Arbitration Lost */
#define TWIM_IER_ARBLST             (_U_(0x1) << TWIM_IER_ARBLST_Pos)
#define TWIM_IER_SMBALERT_Pos       11           /**< \brief (TWIM_IER) SMBus Alert */
#define TWIM_IER_SMBALERT           (_U_(0x1) << TWIM_IER_SMBALERT_Pos)
#define TWIM_IER_TOUT_Pos           12           /**< \brief (TWIM_IER) Timeout */
#define TWIM_IER_TOUT               (_U_(0x1) << TWIM_IER_TOUT_Pos)
#define TWIM_IER_PECERR_Pos         13           /**< \brief (TWIM_IER) PEC Error */
#define TWIM_IER_PECERR             (_U_(0x1) << TWIM_IER_PECERR_Pos)
#define TWIM_IER_STOP_Pos           14           /**< \brief (TWIM_IER) Stop Request Accepted */
#define TWIM_IER_STOP               (_U_(0x1) << TWIM_IER_STOP_Pos)
#define TWIM_IER_HSMCACK_Pos        17           /**< \brief (TWIM_IER) ACK in HS-mode Master Code Phase Received */
#define TWIM_IER_HSMCACK            (_U_(0x1) << TWIM_IER_HSMCACK_Pos)
#define TWIM_IER_MASK               _U_(0x00027F3F) /**< \brief (TWIM_IER) MASK Register */

