zephyrproject-rtos/hal_atmel/asf/sam/include/sam4l/component/twim.h
/* -------- TWIM_IDR : (TWIM Offset: 0x24) ( /W 32) Interrupt Disable Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXRDY:1;          /*!< bit:      0  RHR Data Ready                     */
    uint32_t TXRDY:1;          /*!< bit:      1  THR Data Ready                     */
    uint32_t CRDY:1;           /*!< bit:      2  Ready for More Commands            */
    uint32_t CCOMP:1;          /*!< bit:      3  Command Complete                   */
    uint32_t IDLE:1;           /*!< bit:      4  Master Interface is Idle           */
    uint32_t BUSFREE:1;        /*!< bit:      5  Two-wire Bus is Free               */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t ANAK:1;           /*!< bit:      8  NAK in Address Phase Received      */
    uint32_t DNAK:1;           /*!< bit:      9  NAK in Data Phase Received         */
    uint32_t ARBLST:1;         /*!< bit:     10  Arbitration Lost                   */
    uint32_t SMBALERT:1;       /*!< bit:     11  SMBus Alert                        */
    uint32_t TOUT:1;           /*!< bit:     12  Timeout                            */
    uint32_t PECERR:1;         /*!< bit:     13  PEC Error                          */
    uint32_t STOP:1;           /*!< bit:     14  Stop Request Accepted              */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t HSMCACK:1;        /*!< bit:     17  ACK in HS-mode Master Code Phase Received */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIM_IDR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIM_IDR_OFFSET             0x24         /**< \brief (TWIM_IDR offset) Interrupt Disable Register */
#define TWIM_IDR_RESETVALUE         _U_(0x00000000); /**< \brief (TWIM_IDR reset_value) Interrupt Disable Register */

#define TWIM_IDR_RXRDY_Pos          0            /**< \brief (TWIM_IDR) RHR Data Ready */
#define TWIM_IDR_RXRDY              (_U_(0x1) << TWIM_IDR_RXRDY_Pos)
#define TWIM_IDR_TXRDY_Pos          1            /**< \brief (TWIM_IDR) THR Data Ready */
#define TWIM_IDR_TXRDY              (_U_(0x1) << TWIM_IDR_TXRDY_Pos)
#define TWIM_IDR_CRDY_Pos           2            /**< \brief (TWIM_IDR) Ready for More Commands */
#define TWIM_IDR_CRDY               (_U_(0x1) << TWIM_IDR_CRDY_Pos)
#define TWIM_IDR_CCOMP_Pos          3            /**< \brief (TWIM_IDR) Command Complete */
#define TWIM_IDR_CCOMP              (_U_(0x1) << TWIM_IDR_CCOMP_Pos)
#define TWIM_IDR_IDLE_Pos           4            /**< \brief (TWIM_IDR) Master Interface is Idle */
#define TWIM_IDR_IDLE               (_U_(0x1) << TWIM_IDR_IDLE_Pos)
#define TWIM_IDR_BUSFREE_Pos        5            /**< \brief (TWIM_IDR) Two-wire Bus is Free */
#define TWIM_IDR_BUSFREE            (_U_(0x1) << TWIM_IDR_BUSFREE_Pos)
#define TWIM_IDR_ANAK_Pos           8            /**< \brief (TWIM_IDR) NAK in Address Phase Received */
#define TWIM_IDR_ANAK               (_U_(0x1) << TWIM_IDR_ANAK_Pos)
#define TWIM_IDR_DNAK_Pos           9            /**< \brief (TWIM_IDR) NAK in Data Phase Received */
#define TWIM_IDR_DNAK               (_U_(0x1) << TWIM_IDR_DNAK_Pos)
#define TWIM_IDR_ARBLST_Pos         10           /**< \brief (TWIM_IDR) Arbitration Lost */
#define TWIM_IDR_ARBLST             (_U_(0x1) << TWIM_IDR_ARBLST_Pos)
#define TWIM_IDR_SMBALERT_Pos       11           /**< \brief (TWIM_IDR) SMBus Alert */
#define TWIM_IDR_SMBALERT           (_U_(0x1) << TWIM_IDR_SMBALERT_Pos)
#define TWIM_IDR_TOUT_Pos           12           /**< \brief (TWIM_IDR) Timeout */
#define TWIM_IDR_TOUT               (_U_(0x1) << TWIM_IDR_TOUT_Pos)
#define TWIM_IDR_PECERR_Pos         13           /**< \brief (TWIM_IDR) PEC Error */
#define TWIM_IDR_PECERR             (_U_(0x1) << TWIM_IDR_PECERR_Pos)
#define TWIM_IDR_STOP_Pos           14           /**< \brief (TWIM_IDR) Stop Request Accepted */
#define TWIM_IDR_STOP               (_U_(0x1) << TWIM_IDR_STOP_Pos)
#define TWIM_IDR_HSMCACK_Pos        17           /**< \brief (TWIM_IDR) ACK in HS-mode Master Code Phase Received */
#define TWIM_IDR_HSMCACK            (_U_(0x1) << TWIM_IDR_HSMCACK_Pos)
#define TWIM_IDR_MASK               _U_(0x00027F3F) /**< \brief (TWIM_IDR) MASK Register */

/* -------- TWIM_IMR : (TWIM Offset: 0x28) (R/  32) Interrupt Mask Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t RXRDY:1;          /*!< bit:      0  RHR Data Ready                     */
    uint32_t TXRDY:1;          /*!< bit:      1  THR Data Ready                     */
    uint32_t CRDY:1;           /*!< bit:      2  Ready for More Commands            */
    uint32_t CCOMP:1;          /*!< bit:      3  Command Complete                   */
    uint32_t IDLE:1;           /*!< bit:      4  Master Interface is Idle           */
    uint32_t BUSFREE:1;        /*!< bit:      5  Two-wire Bus is Free               */
    uint32_t :2;               /*!< bit:  6.. 7  Reserved                           */
    uint32_t ANAK:1;           /*!< bit:      8  NAK in Address Phase Received      */
    uint32_t DNAK:1;           /*!< bit:      9  NAK in Data Phase Received         */
    uint32_t ARBLST:1;         /*!< bit:     10  Arbitration Lost                   */
    uint32_t SMBALERT:1;       /*!< bit:     11  SMBus Alert                        */
    uint32_t TOUT:1;           /*!< bit:     12  Timeout                            */
    uint32_t PECERR:1;         /*!< bit:     13  PEC Error                          */
    uint32_t STOP:1;           /*!< bit:     14  Stop Request Accepted              */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t HSMCACK:1;        /*!< bit:     17  ACK in HS-mode Master Code Phase Received */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIM_IMR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

#define TWIM_IMR_OFFSET             0x28         /**< \brief (TWIM_IMR offset) Interrupt Mask Register */
#define TWIM_IMR_RESETVALUE         _U_(0x00000000); /**< \brief (TWIM_IMR reset_value) Interrupt Mask Register */

#define TWIM_IMR_RXRDY_Pos          0            /**< \brief (TWIM_IMR) RHR Data Ready */
#define TWIM_IMR_RXRDY              (_U_(0x1) << TWIM_IMR_RXRDY_Pos)
#define TWIM_IMR_TXRDY_Pos          1            /**< \brief (TWIM_IMR) THR Data Ready */
#define TWIM_IMR_TXRDY              (_U_(0x1) << TWIM_IMR_TXRDY_Pos)
#define TWIM_IMR_CRDY_Pos           2            /**< \brief (TWIM_IMR) Ready for More Commands */
#define TWIM_IMR_CRDY               (_U_(0x1) << TWIM_IMR_CRDY_Pos)
#define TWIM_IMR_CCOMP_Pos          3            /**< \brief (TWIM_IMR) Command Complete */
#define TWIM_IMR_CCOMP              (_U_(0x1) << TWIM_IMR_CCOMP_Pos)
#define TWIM_IMR_IDLE_Pos           4            /**< \brief (TWIM_IMR) Master Interface is Idle */
#define TWIM_IMR_IDLE               (_U_(0x1) << TWIM_IMR_IDLE_Pos)
#define TWIM_IMR_BUSFREE_Pos        5            /**< \brief (TWIM_IMR) Two-wire Bus is Free */
#define TWIM_IMR_BUSFREE            (_U_(0x1) << TWIM_IMR_BUSFREE_Pos)
#define TWIM_IMR_ANAK_Pos           8            /**< \brief (TWIM_IMR) NAK in Address Phase Received */
#define TWIM_IMR_ANAK               (_U_(0x1) << TWIM_IMR_ANAK_Pos)
#define TWIM_IMR_DNAK_Pos           9            /**< \brief (TWIM_IMR) NAK in Data Phase Received */
#define TWIM_IMR_DNAK               (_U_(0x1) << TWIM_IMR_DNAK_Pos)
#define TWIM_IMR_ARBLST_Pos         10           /**< \brief (TWIM_IMR) Arbitration Lost */
#define TWIM_IMR_ARBLST             (_U_(0x1) << TWIM_IMR_ARBLST_Pos)
#define TWIM_IMR_SMBALERT_Pos       11           /**< \brief (TWIM_IMR) SMBus Alert */
#define TWIM_IMR_SMBALERT           (_U_(0x1) << TWIM_IMR_SMBALERT_Pos)
#define TWIM_IMR_TOUT_Pos           12           /**< \brief (TWIM_IMR) Timeout */
#define TWIM_IMR_TOUT               (_U_(0x1) << TWIM_IMR_TOUT_Pos)
#define TWIM_IMR_PECERR_Pos         13           /**< \brief (TWIM_IMR) PEC Error */
#define TWIM_IMR_PECERR             (_U_(0x1) << TWIM_IMR_PECERR_Pos)
#define TWIM_IMR_STOP_Pos           14           /**< \brief (TWIM_IMR) Stop Request Accepted */
#define TWIM_IMR_STOP               (_U_(0x1) << TWIM_IMR_STOP_Pos)
#define TWIM_IMR_HSMCACK_Pos        17           /**< \brief (TWIM_IMR) ACK in HS-mode Master Code Phase Received */
#define TWIM_IMR_HSMCACK            (_U_(0x1) << TWIM_IMR_HSMCACK_Pos)
#define TWIM_IMR_MASK               _U_(0x00027F3F) /**< \brief (TWIM_IMR) MASK Register */

/* -------- TWIM_SCR : (TWIM Offset: 0x2C) ( /W 32) Status Clear Register -------- */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef union {
  struct {
    uint32_t :3;               /*!< bit:  0.. 2  Reserved                           */
    uint32_t CCOMP:1;          /*!< bit:      3  Command Complete                   */
    uint32_t :4;               /*!< bit:  4.. 7  Reserved                           */
    uint32_t ANAK:1;           /*!< bit:      8  NAK in Address Phase Received      */
    uint32_t DNAK:1;           /*!< bit:      9  NAK in Data Phase Received         */
    uint32_t ARBLST:1;         /*!< bit:     10  Arbitration Lost                   */
    uint32_t SMBALERT:1;       /*!< bit:     11  SMBus Alert                        */
    uint32_t TOUT:1;           /*!< bit:     12  Timeout                            */
    uint32_t PECERR:1;         /*!< bit:     13  PEC Error                          */
    uint32_t STOP:1;           /*!< bit:     14  Stop Request Accepted              */
    uint32_t :2;               /*!< bit: 15..16  Reserved                           */
    uint32_t HSMCACK:1;        /*!< bit:     17  ACK in HS-mode Master Code Phase Received */
    uint32_t :14;              /*!< bit: 18..31  Reserved                           */
  } bit;                       /*!< Structure used for bit  access                  */
  uint32_t reg;                /*!< Type      used for register access              */
} TWIM_SCR_Type;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

